ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_timer.c
/**
  ******************************************************************************
  * @file    bl606p_timer.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl606p_timer.h"
#include "bl606p_glb.h"

/** @addtogroup  BL606P_Peripheral_Driver
 *  @{
 */

/** @addtogroup  TIMER
 *  @{
 */

/** @defgroup  TIMER_Private_Macros
 *  @{
 */
#define TIMER_MAX_MATCH 3

/*@} end of group TIMER_Private_Macros */

/** @defgroup  TIMER_Private_Types
 *  @{
 */

/*@} end of group TIMER_Private_Types */

/** @defgroup  TIMER_Private_Variables
 *  @{
 */
static const uint32_t timerAddr[TIMER_ID_MAX] = { TIMER0_BASE, TIMER1_BASE };
#ifndef BFLB_USE_HAL_DRIVER
intCallback_Type *timerIntCbfArra[TIMER_ID_MAX][TIMER_CH_MAX][TIMER_INT_ALL] = { NULL };
intCallback_Type *wdtIntCbfArra[WDT_ID_MAX][WDT_INT_ALL] = { NULL };
#endif

/*@} end of group TIMER_Private_Variables */

/** @defgroup  TIMER_Global_Variables
 *  @{
 */

/*@} end of group TIMER_Global_Variables */

/** @defgroup  TIMER_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static void TIMER_IntHandler(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh);
#endif

/*@} end of group TIMER_Private_Fun_Declaration */

/** @defgroup  TIMER_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  TIMER interrupt common handler function
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER_IntHandler(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh)
{
    uint32_t intId;
    uint32_t tmpVal;
    uint32_t tmpAddr;
    uint32_t TIMERx = timerAddr[timerId];

    intId = BL_RD_WORD(TIMERx + TIMER_TSR2_OFFSET + 4 * timerCh);
    tmpAddr = TIMERx + TIMER_TICR2_OFFSET + 4 * timerCh;
    tmpVal = BL_RD_WORD(tmpAddr);

    /* Comparator 0 match interrupt */
    if (BL_IS_REG_BIT_SET(intId, TIMER_TSR2_0)) {
        BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TSR2_0));

        if (timerIntCbfArra[timerId][timerCh][TIMER_INT_COMP_0] != NULL) {
            /* Call the callback function */
            timerIntCbfArra[timerId][timerCh][TIMER_INT_COMP_0]();
        }
    }

    /* Comparator 1 match interrupt */
    if (BL_IS_REG_BIT_SET(intId, TIMER_TSR2_1)) {
        BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TSR2_1));

        if (timerIntCbfArra[timerId][timerCh][TIMER_INT_COMP_1] != NULL) {
            /* Call the callback function */
            timerIntCbfArra[timerId][timerCh][TIMER_INT_COMP_1]();
        }
    }

    /* Comparator 2 match interrupt */
    if (BL_IS_REG_BIT_SET(intId, TIMER_TSR2_2)) {
        BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TSR2_2));

        if (timerIntCbfArra[timerId][timerCh][TIMER_INT_COMP_2] != NULL) {
            /* Call the callback function */
            timerIntCbfArra[timerId][timerCh][TIMER_INT_COMP_2]();
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  Get the specified channel and match comparator value
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  cmpNo: TIMER comparator ID type
 *
 * @return Match comapre register value
 *
*******************************************************************************/
uint32_t TIMER_GetCompValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

    tmpVal = BL_RD_WORD(TIMERx + TIMER_TMR2_0_OFFSET + 4 * (TIMER_MAX_MATCH * timerCh + cmpNo));
    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  TIMER set specified channel and comparator compare value
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  cmpNo: TIMER comparator ID type
 * @param  val: TIMER match compare register value
 *
 * @return None
 *
*******************************************************************************/
void TIMER_SetCompValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo, uint32_t val)
{
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

