ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_timer.c
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(TIMER0_WDT_IRQn, TIMER0_WDT_IRQHandler);
    Interrupt_Handler_Register(TIMER1_WDT_IRQn, TIMER1_WDT_IRQHandler);
#endif

    WDT_ENABLE_ACCESS(TIMERx);

    tmpVal = BL_RD_REG(TIMERx, TIMER_WMER);

    BL_WR_REG(TIMERx, TIMER_WMER, BL_SET_REG_BIT(tmpVal, TIMER_WE));
}

/****************************************************************************/ /**
 * @brief  Watchdog timer disable function
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return None
 *
*******************************************************************************/
void WDT_Disable(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    WDT_ENABLE_ACCESS(TIMERx);

    tmpVal = BL_RD_REG(TIMERx, TIMER_WMER);

    BL_WR_REG(TIMERx, TIMER_WMER, BL_CLR_REG_BIT(tmpVal, TIMER_WE));
}

/****************************************************************************/ /**
 * @brief  Watchdog timer disable function
 *
 * @param  wdtId: Watchdog ID type
 *
 * @return None
 *
*******************************************************************************/
void WDT_ForceClockDivision(WDT_ID_Type wdtId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));

    /* write 0 after write 1 to force clock division */
    tmpVal = BL_RD_REG(TIMERx, TIMER_TCDR_FORCE);

    tmpVal = BL_SET_REG_BIT(tmpVal, TIMER_WCDR_FORCE);

    BL_WR_REG(TIMERx, TIMER_TCDR_FORCE, tmpVal);

    tmpVal = BL_RD_REG(TIMERx, TIMER_TCDR_FORCE);

    tmpVal = BL_CLR_REG_BIT(tmpVal, TIMER_WCDR_FORCE);

    BL_WR_REG(TIMERx, TIMER_TCDR_FORCE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Watchdog timer mask or unmask certain or all interrupt
 *
 * @param  wdtId: Watchdog ID type
 * @param  intType: Watchdog interrupt type
 * @param  intMask: Watchdog interrupt mask value:MASK:disbale interrupt.UNMASK:enable interrupt
 *
 * @return None
 *
*******************************************************************************/
void WDT_IntMask(WDT_ID_Type wdtId, WDT_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));
    CHECK_PARAM(IS_WDT_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    WDT_ENABLE_ACCESS(TIMERx);

    /* Deal with watchdog match/interrupt enable register,
	  WRIE:watchdog reset/interrupt enable */
    tmpVal = BL_RD_REG(TIMERx, TIMER_WMER);

    switch (intType) {
        case WDT_INT:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                /* 0 means generates a watchdog interrupt,
				   a watchdog timer reset is not generated*/
                BL_WR_REG(TIMERx, TIMER_WMER, BL_CLR_REG_BIT(tmpVal, TIMER_WRIE));
            } else {
                /* Disable this interrupt */
                /* 1 means generates a watchdog timer reset,
				   a watchdog  interrupt is not generated*/
                BL_WR_REG(TIMERx, TIMER_WMER, BL_SET_REG_BIT(tmpVal, TIMER_WRIE));
            }

            break;

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  Watchdog install interrupt callback
 *
 * @param  wdtId: Watchdog ID type
 * @param  wdtInt: Watchdog interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void WDT_Int_Callback_Install(WDT_ID_Type wdtId, WDT_INT_Type wdtInt, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));
    CHECK_PARAM(IS_WDT_INT_TYPE(wdtInt));

    wdtIntCbfArra[wdtId][wdtInt] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  Watchdog set gpio polarity
 *
 * @param  wdtId: Watchdog ID type
 * @param  polarity: Watchdog GPIO polarity
 *
 * @return None
 *
*******************************************************************************/
void WDT_GPIOSetPolarity(WDT_ID_Type wdtId, TIMER_GPIO_Polarity_Type polarity)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[wdtId];

    /* Check the parameters */
    CHECK_PARAM(IS_WDT_ID_TYPE(wdtId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpVal = BL_RD_REG(TIMERx, TIMER_GPIO);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_WDT_GPIO_INV, polarity);
    BL_WR_REG(TIMERx, TIMER_GPIO, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER0 channel 0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER0_CH0_IRQHandler(void)
{
    TIMER_IntHandler(TIMER0_ID, TIMER_CH0);
}
#endif

/****************************************************************************/ /**
 * @brief  TIMER0 channel 1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER0_CH1_IRQHandler(void)
{
    TIMER_IntHandler(TIMER0_ID, TIMER_CH1);
}
#endif

/****************************************************************************/ /**
 * @brief  TIMER0 watchdog interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER0_WDT_IRQHandler(void)
{
    uint32_t tmpVal;

