ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_timer.c
    WDT_ENABLE_ACCESS(TIMER0_BASE);

    tmpVal = BL_RD_REG(TIMER0_BASE, TIMER_WICR);
    BL_WR_REG(TIMER0_BASE, TIMER_WICR, BL_SET_REG_BIT(tmpVal, TIMER_WICLR));

    if (wdtIntCbfArra[WDT0_ID][WDT_INT] != NULL) {
        /* Call the callback function */
        wdtIntCbfArra[WDT0_ID][WDT_INT]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  TIMER1 channel 0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER1_CH0_IRQHandler(void)
{
    TIMER_IntHandler(TIMER1_ID, TIMER_CH0);
}
#endif

/****************************************************************************/ /**
 * @brief  TIMER1 channel 1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER1_CH1_IRQHandler(void)
{
    TIMER_IntHandler(TIMER1_ID, TIMER_CH1);
}
#endif

/****************************************************************************/ /**
 * @brief  TIMER1 watchdog interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER1_WDT_IRQHandler(void)
{
    uint32_t tmpVal;

    WDT_ENABLE_ACCESS(TIMER1_BASE);

    tmpVal = BL_RD_REG(TIMER1_BASE, TIMER_WICR);
    BL_WR_REG(TIMER1_BASE, TIMER_WICR, BL_SET_REG_BIT(tmpVal, TIMER_WICLR));

    if (wdtIntCbfArra[WDT1_ID][WDT_INT] != NULL) {
        /* Call the callback function */
        wdtIntCbfArra[WDT1_ID][WDT_INT]();
    }
}
#endif
/*@} end of group TIMER_Private_Functions */

/*@} end of group TIMER */

/*@} end of group BL606P_Peripheral_Driver */
